fix: auto sync
